tutorials/pbeTransportFoam/combustion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0.0  0.0  0.0)
    (0.89658  0.07844  0.0)
    (0.89658  0.07844  0.8)
    (0.0  0.0  0.8)
    (0.89658  -0.07844  0.0)
    (0.89658  -0.07844  0.8)
);

blocks
(
    hex (0 4 1 0 3 5 2 3) (1 1 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    { 
        type wedge;
        faces  
        (
            (0 3 5 4)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 4 5 2)
        );
    }
    fuel
    {
        type patch;
        faces
        (
            (0 4 1 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 5 2 3)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
);


// ************************************************************************* //
