tutorials/pbeTransportFoam/combustion/system/blockMeshDictCone
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (1.76777  1.76777  0.0)
    (-1.76777  1.76777  0.0)
    (-1.76777  -1.76777  0.0)
    (1.76777  -1.76777  0.0)
    (1.76777  1.76777  0.8)
    (-1.76777  1.76777  0.8)
    (-1.76777  -1.76777  0.8)
    (1.76777  -1.76777  0.8)
);

edges
(
    arc 0 1 (0.0 2.5 0.0)
    arc 1 2 (-2.5 0.0 0.0)
    arc 2 3 (0.0 -2.5 0.0)
    arc 3 0 (2.5 0.0 0.0)
    arc 4 5 (0.0 2.5 0.8)
    arc 5 6 (-2.5 0.0 0.8)
    arc 6 7 (0.0 -2.5 0.8)
    arc 7 4 (2.5 0.0 0.8)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 100) simpleGrading (1 1 1)
);


boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (0 4 5 1)
            (2 6 7 3)
            (1 5 6 2)
        );
    }
    fuel
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
