tutorials/pbeTransportFoam/combustion/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          100;
        startFace       99;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          100;
        startFace       199;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       299;
    }
    fuel
    {
        type            patch;
        nFaces          1;
        startFace       399;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       400;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       401;
    }
)

// ************************************************************************* //
