tutorials/pbeTransportFoam/combustion/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-10;
        relTol           0.01;

        smoother         DICGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }
    
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0.0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }
    
    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1.0e-12;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    pRefCell            0;
    pRefValue           1.0e5;
    
    residualControl
    {
        "moment.*"      
        {   
            tolerance 1e-6;
            relTol    0;
        }
    }
}

/*relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.7;
    }
    
    equations
    {
        U               0.3;
        "(h)"         0.7;
        "moment.*"      0.9;
    }
}*/



// ************************************************************************* //
