tutorials/pbeTransportFoam/combustion/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

mkdir 0 2>&1
cp 0.org/* 0/ 2>&1

#cp -f system/controlDict.flow system/controlDict
#cp -f constant/thermophysicalProperties.flow constant/thermophysicalProperties
#runApplication blockMesh
#decomposePar
#mpirun -np 8 reactingFoam -parallel
#runApplication reconstructPar -latestTime

#mv -f processor* combustion/

mv 0.23 0.23.flow
cp -f 0.23.flow/* 0/ 2>&1
cp -f system/controlDict.pbe system/controlDict
cp -f constant/thermophysicalProperties.pbe constant/thermophysicalProperties

runApplication pbeTransportFoam
#decomposePar 
#mpirun -np 8 pbeTransportFoam -parallel

#runApplication reconstructPar -latestTime
# ----------------------------------------------------------------- end-of-file
